app/controllers/home_controller.rb

SELECT count(*) AS count_all FROM "sites"
---
  def index
    @count = Site.count